tests/load/100k-enterprise.yml
# tests/load/100k-enterprise.yml — Stage 4: 100,000+ concurrent users, enterprise.
# Target: 3 Autoscaled Pods baseline (up to 16 pods via HPA) + Multi-AZ Redis + DynamoDB On-Demand.
#
# Pass criteria and how each is actually measured:
#   - p99 < 120ms globally             -> Artillery's own summary report (this file measures this directly)
#   - no ProvisionedThroughputExceededException
#                                        -> DynamoDB CloudWatch metrics / app error logs, NOT this file
#   - 10,000 msg/s peak burst           -> server-side Socket.IO message counter, NOT Artillery's req/s
#   - 2,000 concurrent WebRTC calls     -> NOT covered by this file at all. Artillery has no WebRTC
#                                          engine; this needs a separate tool (e.g. a headless
#                                          aiortc/Pion harness) run alongside this test, not folded
#                                          into it.
#
# Run (distributed runners, one per AZ):
#   npx artillery run tests/load/100k-enterprise.yml --environment production
#   (see 50k-scale.yml header for why --count does not multiply throughput)
#
# Concurrency check: avg session ≈ join-think(1.5s) + 25 × send-think(4.5s) ≈ 114s.
# Note: Media upload includes think time to maintain session duration parity across weights.
# arrivalRate 880/s × 114s ≈ 100,320 concurrent — matches the 100,000+ target.

config:
  target: "http://localhost:8080"
  environments:
    production:
      target: "{{ $processEnvironment.TARGET_URL }}"
  phases:
    - name: "Warm-up"
      duration: 180
      arrivalRate: 100
      maxVusers: 25000
    - name: "Ramp to 100,000 concurrent"
      duration: 900
      arrivalRate: 100
      rampTo: 880
      maxVusers: 90000
    - name: "Peak Burst (~100,000 Concurrent)"
      duration: 1200
      arrivalRate: 880
      maxVusers: 110000
  engines:
    socketio-v3: {}
  processor: "./scenarios/chat-chatter.js"
  variables:
    roomPoolSize: 20000 # ~5 users/room average at peak
  ensure:
    p99: 120
    maxErrorRate: 1

scenarios:
  - name: "Active Chat Session"
    engine: socketio-v3
    weight: 80
    flow:
      - function: "assignRoom"
      - emit:
          channel: "join_room"
          data:
            conversationId: "{{ roomId }}"
      - think: "{{ $randomNumber(1,2) }}"
      - loop:
          - function: "sendEncryptedChatter"
          - emit:
              channel: "send_message"
              data:
                conversationId: "{{ roomId }}"
                content: "{{ content }}"
                isEncrypted: true
                nonce: "{{ nonce }}"
                encVersion: 1
          - think: "{{ $randomNumber(3,6) }}"
        count: 25
      - emit:
          channel: "leave_room"
          data:
            conversationId: "{{ roomId }}"

  - name: "Media Upload Burst"
    engine: http
    weight: 20
    flow:
      - loop:
          - post:
              url: "/api/media/presigned-url"
              json:
                fileType: "image/jpeg"
                fileExtension: "jpg"
          - think: "{{ $randomNumber(10, 15) }}"
        count: 8